"""
1. 题目1：基础知识练习
1. 将如下多个列表合并为一个列表，并去重重复元素，
排好序（升序）后输出到控制台。
"""

# 数据准备
# list11 = ['M', 'A', 'C', 'E', 'F', 'G', 'H', 'L', 'N', 'I', 'J', 'K', 'O']
# list12 = ['X', 'Z', 'T', 'Y', 'D', 'E', 'F', 'G']
# list13 = ['W', 'A', 'S', 'D']
#
# for word in list13 + list12:
#     if word not in list11:
#         list11.append(word)
# print(list11)


"""
2. 将如下列表中能被3 或 5整除的元素提出来，
并获取这些数字对应的平方，组成一个新的列表。
"""
# 数据准备
# list21 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 1,
#           5, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]
#
# list22 = []
# for num in list21:
#     if num % 3 == 0 or num % 5 == 0:
#         list22.append(num)
# print(list22)


"""
3. 将如下列表中的正数提取出来，封装为一个新的列表。
"""
# 数据准备
# list31 = [11, 2, 31, 4, -5, 15, 17, 28, 49, 10, -11, 16, 54, -14, 36, -16, 87, -39]
#
# list32 = []
# for num in list31:
#     if num >= 0:
#         list32.append(num)
# print(list32)


"""
4. 输入一个字符串, 判断该字符串是否是回文(两边对称) 。
"黄山落叶松叶落山黄"
"上海自来水来自海上"
"""
# str41 = input("请输入一段字符串: ")
# str_len = len(str41)
# status = True
# for l in range(str_len):
#     if str41[l] != str41[-1 - l]:
#         status = False
# if status:
#     print("字符串是回文")
# else:
#     print("字符串不是回文")


"""
5. 将用户输入的10个字符串, 反转后全部转换为大写,
 然后记录在列表中, 最后将列表内容，遍历输出来。
"""
# list51 = []
# for i in range(10):
#     list52 = input(f"请输入第{i+1}个字符串")
#
#     list51.append(list52[::-1].upper())
#
# for i in list51:
#     print(i)


"""
6. 现有两个变量，分别为：a = 10， b = 20，
现需要将这两个变量值交换，然后输出到控制台。
"""
# a = 10
# b = 20
# a, b = b, a
# print(a, b)


"""
7. 现有三个变量，分别为：a = 100，b = 200，c = 300
现需要将这三个变量值进行交换，将 a,b,c 的值分别赋值给
c,a,b，并将其输出到控制台。
"""
# a = 100
# b = 200
# c = 300
# a, b, c = c, a, b